# Space_CountAssZones

## Description
Returns count of assigned zones of the space object

```pascal
FUNCTION Space_CountAssZones(space : HANDLE) : INTEGER;
```

```python

def vs.Space_CountAssZones(space):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|space|HANDLE||

## Version
Availability: from Vectorworks 2014
## Category
* SpaceObjectCoreTools